[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:52:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <>
-                  <NavDropdown
-                    title="Admin"
-                    id="appnavbar-admin-dropdown"
-                    data-testid="appnavbar-admin-dropdown"
-                  >
-                    <NavDropdown.Item href="/admin/users">
-                      Users
-                    </NavDropdown.Item>
-                  </NavDropdown>
-                  <Nav.Link as={Link} to="/moderate">
-                    Moderate
-                  </Nav.Link>
-                </>
-              )}
+              {true}
               {currentUser && currentUser.loggedIn ? (
                 <>
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:52:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <>
-                  <NavDropdown
-                    title="Admin"
-                    id="appnavbar-admin-dropdown"
-                    data-testid="appnavbar-admin-dropdown"
-                  >
-                    <NavDropdown.Item href="/admin/users">
-                      Users
-                    </NavDropdown.Item>
-                  </NavDropdown>
-                  <Nav.Link as={Link} to="/moderate">
-                    Moderate
-                  </Nav.Link>
-                </>
-              )}
+              {false}
               {currentUser && currentUser.loggedIn ? (
                 <>
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
