[Killed] BlockStatement
src/main/pages/HomePage.js:5:36
 import { useBackend } from "../utils/useBackend";
 import DiningCommonsTable from "../components/DiningCommons/DiningCommonsTable";
 
-export default function HomePage() {
-  const { data } = useBackend(
-    // Stryker disable next-line all : don't test internal caching of React Query
-    [`/api/dining/all`],
-    { method: "GET", url: "/api/dining/all" },
-    [],
-  );
-
-  const date = new Date().toISOString().split("T")[0];
-
-  return (
-    <BasicLayout>
-      <h1>Dining Commons</h1>
-      <DiningCommonsTable commons={data} date={date} />
-    </BasicLayout>
-  );
-}
+export default function HomePage() {}
 
killedBy: HomePage tests Renders table with 4 dining commons
statusReason: Error: Unable to find an element by: [data-testid="DiningCommonsTable-cell-row-0-col-code"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ObjectLiteral
src/main/pages/HomePage.js:9:5
   const { data } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/dining/all`],
-    { method: "GET", url: "/api/dining/all" },
+    {},
     [],
   );
killedBy: HomePage tests Renders table with 4 dining commons
statusReason: Error: Unable to find an element by: [data-testid="DiningCommonsTable-cell-row-0-col-code"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/HomePage.js:13:47
     [],
   );
 
-  const date = new Date().toISOString().split("T")[0];
+  const date = new Date().toISOString().split("")[0];
 
   return (
killedBy: HomePage tests Renders table with 4 dining commons
statusReason: Error: expect(element).toHaveAttribute("href", "/diningcommons/2025-03-11/carrillo") // element.getAttribute("href") === "/diningcommons/2025-03-11/carrillo"

Expected the element to have attribute:
  href="/diningcommons/2025-03-11/carrillo"
Received:
  href="/diningcommons/2/carrillo"
