[Killed] LogicalOperator
main/pages/Meal/MealTimesPage.js:30:10
         <h1>
           Meals at {diningCommonsCode} for {dateTime}
         </h1>
-        {meals && (
-          <MealTable
-            meals={meals}
-            dateTime={dateTime}
-            diningCommonsCode={diningCommonsCode}
-          />
-        )}
+        {meals || <MealTable meals={meals} dateTime={dateTime} diningCommonsCode={diningCommonsCode} />}
       </div>
     </BasicLayout>
killedBy: MealTimesPage tests displays correct information in the table
statusReason: Error: Objects are not valid as a React child (found: object with keys {name, code}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/pages/Meal/MealTimesPage.js:30:10
         <h1>
           Meals at {diningCommonsCode} for {dateTime}
         </h1>
-        {meals && (
-          <MealTable
-            meals={meals}
-            dateTime={dateTime}
-            diningCommonsCode={diningCommonsCode}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: MealTimesPage tests displays correct information in the table
statusReason: TestingLibraryElementError: Unable to find an element with the text: Breakfast. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
