[Killed] ObjectLiteral
main/pages/MenuItem/MenuItemPage.js:17:5
   const { data: menuItems } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/diningcommons/${date}/${diningCommons}/${meal}`],
-    {
-      // Stryker disable next-line all : the default method is get, so replacing with an empty string will do nothing
-      method: "GET",
-      url: `/api/diningcommons/${date}/${diningCommons}/${meal}`,
-    },
+    {},
     // Stryker disable next-line all : Don't test empty initial data
     [],
killedBy: MenuItemPage renders table correctly MenuItemPage renders 5 Menu Items Correctly
statusReason: Error: Unable to find an element by: [data-testid="MenuItemTable-cell-row-0-col-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/MenuItem/MenuItemPage.js:20:12
     {
       // Stryker disable next-line all : the default method is get, so replacing with an empty string will do nothing
       method: "GET",
-      url: `/api/diningcommons/${date}/${diningCommons}/${meal}`,
+      url: ``,
     },
     // Stryker disable next-line all : Don't test empty initial data
killedBy: MenuItemPage renders table correctly MenuItemPage renders 5 Menu Items Correctly
statusReason: Error: Unable to find an element by: [data-testid="MenuItemTable-cell-row-0-col-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] MethodExpression
main/pages/MenuItem/MenuItemPage.js:28:39
 
   return (
     <BasicLayout>
-      <h2>{meal.at(0).toUpperCase() + meal.substring(1)}</h2>
+      <h2>{meal.at(0).toUpperCase() + meal}</h2>
       <MenuItemTable currentUser={currentUser} menuItems={menuItems} />
     </BasicLayout>
killedBy: MenuItemPage MenuItemPage works with no backend
statusReason: TestingLibraryElementError: Unable to find an element with the text: Breakfast. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArithmeticOperator
main/pages/MenuItem/MenuItemPage.js:28:12
 
   return (
     <BasicLayout>
-      <h2>{meal.at(0).toUpperCase() + meal.substring(1)}</h2>
+      <h2>{meal.at(0).toUpperCase() - meal.substring(1)}</h2>
       <MenuItemTable currentUser={currentUser} menuItems={menuItems} />
     </BasicLayout>
killedBy: MenuItemPage MenuItemPage works with no backend
statusReason: TestingLibraryElementError: Unable to find an element with the text: Breakfast. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
