[Killed] ArrowFunction
src/main/pages/ProfilePage.js:18:31
     handleSubmit,
   } = useForm();
 
-  const objectToAxiosParams = (user) => ({
-    url: "/api/currentUser/updateAlias",
-    method: "POST",
-    params: {
-      proposedAlias: user.proposedAlias,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
   const onSuccess = (user) => {
     toast(`Alias Awaiting Moderation: ${user.proposedAlias}`);
killedBy: ProfilePage tests handles alias submission successfully and sends correct params
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Alias Awaiting Moderation: NewPropAlias"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
src/main/pages/ProfilePage.js:25:31
       proposedAlias: user.proposedAlias,
     },
   });
-  const onSuccess = (user) => {
-    toast(`Alias Awaiting Moderation: ${user.proposedAlias}`);
-  };
+  const onSuccess = (user) => {};
 
   const mutation = useBackendMutation(
killedBy: ProfilePage tests handles alias submission successfully and sends correct params
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Alias Awaiting Moderation: NewPropAlias"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
src/main/pages/ProfilePage.js:43:36
   const { user } = root;
   const { email, pictureUrl, fullName } = user;
 
-  const onSubmit = async (data) => {
-    mutation.mutate({ proposedAlias: data.alias });
-  };
+  const onSubmit = async (data) => {};
 
   return (
killedBy: ProfilePage tests handles alias submission successfully and sends correct params
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Alias Awaiting Moderation: NewPropAlias"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ObjectLiteral
src/main/pages/ProfilePage.js:44:21
   const { email, pictureUrl, fullName } = user;
 
   const onSubmit = async (data) => {
-    mutation.mutate({ proposedAlias: data.alias });
+    mutation.mutate({});
   };
 
killedBy: ProfilePage tests handles alias submission successfully and sends correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "proposedAlias": "NewPropAlias",
+   "proposedAlias": undefined,

[Killed] StringLiteral
src/main/pages/ProfilePage.js:72:30
               <Form.Label>Alias</Form.Label>
               <Form.Control
                 type="text"
-                {...register("alias", {
+                {...register("", {
                   required: "Alias is required.",
                 })}
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
src/main/pages/ProfilePage.js:73:29
               <Form.Control
                 type="text"
                 {...register("alias", {
-                  required: "Alias is required.",
+                  required: "",
                 })}
                 isInvalid={Boolean(errors.alias)}
killedBy: ProfilePage tests displays validation error when alias is empty
statusReason: Error: Unable to find an element with the text: Alias is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] OptionalChaining
src/main/pages/ProfilePage.js:79:18
                 placeholder="Enter your new alias"
               />
               <Form.Control.Feedback type="invalid">
-                {errors.alias?.message}
+                {errors.alias.message}
               </Form.Control.Feedback>
             </Form.Group>
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ArrayDeclaration
src/main/pages/ProfilePage.js:92:36
             <Row className="mt-5">
               <Col md={12}>
                 <h4>Your Current User Information</h4>
-                <UsersTable users={[currentUser.root.user]} />
+                <UsersTable users={[]} />
               </Col>
             </Row>
killedBy: ProfilePage tests displays initial alias correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: NewAlias. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
