[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.js:6:18
 import { Link } from "react-router-dom";
 
 export default function DiningCommonsTable({ commons, date }) {
-  const testid = "DiningCommonsTable";
+  const testid = "";
   const columns = [
     {
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: Error: Unable to find an element by: [data-testid="DiningCommonsTable-cell-row-0-col-code"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.js:9:15
   const testid = "DiningCommonsTable";
   const columns = [
     {
-      Header: "Code",
+      Header: "",
       accessor: "code", // accessor is the "key" in the data
       Cell: ({ value }) => (
killedBy: DiningCommonsTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.js:10:17
   const columns = [
     {
       Header: "Code",
-      accessor: "code", // accessor is the "key" in the data
+      accessor: "", // accessor is the "key" in the data
       Cell: ({ value }) => (
         <Link to={`/diningcommons/${date}/${value}`}>{value}</Link>
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: Error: Unable to find an element by: [data-testid="DiningCommonsTable-cell-row-0-col-code"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/DiningCommons/DiningCommonsTable.js:11:13
     {
       Header: "Code",
       accessor: "code", // accessor is the "key" in the data
-      Cell: ({ value }) => (
-        <Link to={`/diningcommons/${date}/${value}`}>{value}</Link>
-      ),
+      Cell: () => undefined,
     },
     {
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: carrillo. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.js:12:19
       Header: "Code",
       accessor: "code", // accessor is the "key" in the data
       Cell: ({ value }) => (
-        <Link to={`/diningcommons/${date}/${value}`}>{value}</Link>
+        <Link to={``}>{value}</Link>
       ),
     },
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: Error: expect(element).toHaveAttribute("href", "/diningcommons/2025-03-11/carrillo") // element.getAttribute("href") === "/diningcommons/2025-03-11/carrillo"

Expected the element to have attribute:
  href="/diningcommons/2025-03-11/carrillo"
Received:
  href="/"

[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.js:20:15
       accessor: "name",
     },
     {
-      Header: "Has Dining Cam",
+      Header: "",
       accessor: "hasDiningCam",
       // Credits to Jayden for the code here!
killedBy: DiningCommonsTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Has Dining Cam. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/DiningCommons/DiningCommonsTable.js:24:13
       accessor: "hasDiningCam",
       // Credits to Jayden for the code here!
       // Renders a checkmark box.
-      Cell: ({ value }) => (value ? "✅" : "❌"),
+      Cell: () => undefined,
     },
     {
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ✅
Received:

[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.js:24:43
       accessor: "hasDiningCam",
       // Credits to Jayden for the code here!
       // Renders a checkmark box.
-      Cell: ({ value }) => (value ? "✅" : "❌"),
+      Cell: ({ value }) => (value ? "✅" : ""),
     },
     {
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected when hasDiningCam is false
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ❌
Received:


Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/DiningCommons/DiningCommonsTable.js:29:13
     {
       Header: "Has Sack Meal",
       accessor: "hasSackMeal",
-      Cell: ({ value }) => (value ? "✅" : "❌"),
+      Cell: () => undefined,
     },
     {
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ❌
Received:

[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.js:29:43
     {
       Header: "Has Sack Meal",
       accessor: "hasSackMeal",
-      Cell: ({ value }) => (value ? "✅" : "❌"),
+      Cell: ({ value }) => (value ? "✅" : ""),
     },
     {
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ❌
Received:

[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.js:32:15
       Cell: ({ value }) => (value ? "✅" : "❌"),
     },
     {
-      Header: "Has Takeout Meal",
+      Header: "",
       accessor: "hasTakeoutMeal",
       Cell: ({ value }) => (value ? "✅" : "❌"),
killedBy: DiningCommonsTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Has Takeout Meal. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.js:33:17
     },
     {
       Header: "Has Takeout Meal",
-      accessor: "hasTakeoutMeal",
+      accessor: "",
       Cell: ({ value }) => (value ? "✅" : "❌"),
     },
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="DiningCommonsTable-cell-row-0-col-hasTakeoutMeal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/DiningCommons/DiningCommonsTable.js:34:13
     {
       Header: "Has Takeout Meal",
       accessor: "hasTakeoutMeal",
-      Cell: ({ value }) => (value ? "✅" : "❌"),
+      Cell: () => undefined,
     },
     {
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ❌
Received:

[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.js:34:37
     {
       Header: "Has Takeout Meal",
       accessor: "hasTakeoutMeal",
-      Cell: ({ value }) => (value ? "✅" : "❌"),
+      Cell: ({ value }) => (value ? "" : "❌"),
     },
     {
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ✅
Received:

[Killed] ObjectLiteral
main/components/DiningCommons/DiningCommonsTable.js:36:5
       accessor: "hasTakeoutMeal",
       Cell: ({ value }) => (value ? "✅" : "❌"),
     },
-    {
-      Header: "Latitude",
-      accessor: "latitude",
-    },
+    {},
     {
       Header: "Longitude",
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.js:41:15
       accessor: "latitude",
     },
     {
-      Header: "Longitude",
+      Header: "",
       accessor: "longitude",
     },
killedBy: DiningCommonsTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Longitude. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
