[Killed] BlockStatement
main/components/Meal/MealTable.js:10:4
   dateTime,
   diningCommonsCode,
   testIdPrefix = "MealTable",
-}) {
-  const columns = [
-    {
-      Header: "Meal",
-      accessor: "name", // accessor is the "key" in the data
-      Cell: ({ row }) => (
-        <Link
-          to={`/diningcommons/${dateTime}/${diningCommonsCode}/${row.original.code}`}
-        >
-          {row.original.name}
-        </Link>
-      ),
-    },
-  ];
-
-  return <OurTable data={meals} columns={columns} testid={testIdPrefix} />;
-}
+}) {}
 
killedBy: MealTimesPage tests displays correct information in the table
statusReason: TestingLibraryElementError: Unable to find an element with the text: Breakfast. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/Meal/MealTable.js:12:5
   testIdPrefix = "MealTable",
 }) {
   const columns = [
-    {
-      Header: "Meal",
-      accessor: "name", // accessor is the "key" in the data
-      Cell: ({ row }) => (
-        <Link
-          to={`/diningcommons/${dateTime}/${diningCommonsCode}/${row.original.code}`}
-        >
-          {row.original.name}
-        </Link>
-      ),
-    },
+    {},
   ];
 
killedBy: MealTimesPage tests renders without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Meal/MealTable.js:13:15
 }) {
   const columns = [
     {
-      Header: "Meal",
+      Header: "",
       accessor: "name", // accessor is the "key" in the data
       Cell: ({ row }) => (
killedBy: MealTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Meal. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Meal/MealTable.js:14:17
   const columns = [
     {
       Header: "Meal",
-      accessor: "name", // accessor is the "key" in the data
+      accessor: "", // accessor is the "key" in the data
       Cell: ({ row }) => (
         <Link
killedBy: MealTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MealTable-cell-row-0-col-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/Meal/MealTable.js:15:13
     {
       Header: "Meal",
       accessor: "name", // accessor is the "key" in the data
-      Cell: ({ row }) => (
-        <Link
-          to={`/diningcommons/${dateTime}/${diningCommonsCode}/${row.original.code}`}
-        >
-          {row.original.name}
-        </Link>
-      ),
+      Cell: () => undefined,
     },
   ];
killedBy: MealTimesPage tests displays correct information in the table
statusReason: TestingLibraryElementError: Unable to find an element with the text: Breakfast. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Meal/MealTable.js:17:15
       accessor: "name", // accessor is the "key" in the data
       Cell: ({ row }) => (
         <Link
-          to={`/diningcommons/${dateTime}/${diningCommonsCode}/${row.original.code}`}
+          to={``}
         >
           {row.original.name}
killedBy: MealTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveAttribute("href", "/diningcommons/2024-11-25/portola/breakfast") // element.getAttribute("href") === "/diningcommons/2024-11-25/portola/breakfast"

Expected the element to have attribute:
  href="/diningcommons/2024-11-25/portola/breakfast"
Received:
  href="/"
