[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.js:4:67
 import OurTable, { ButtonColumn } from "../OurTable";
 import { hasRole } from "../../utils/currentUser";
 
-export default function MenuItemTable({ menuItems, currentUser }) {
-  const testid = "MenuItemTable";
-  const reviewCallback = async (_cell) => {
-    alert("Reviews coming soon!");
-  };
-  const columns = [
-    {
-      Header: "Item Name",
-      accessor: "name",
-    },
-    {
-      Header: "Station",
-      accessor: "station",
-    },
-  ];
-  if (hasRole(currentUser, "ROLE_USER")) {
-    columns.push(
-      ButtonColumn("Review Item", "warning", reviewCallback, testid),
-    );
-  }
-
-  return <OurTable columns={columns} data={menuItems} testid={testid} />;
-}
+export default function MenuItemTable({ menuItems, currentUser }) {}
 
killedBy: MenuItemPage renders table correctly MenuItemPage renders 5 Menu Items Correctly
statusReason: Error: Unable to find an element by: [data-testid="MenuItemTable-cell-row-0-col-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.js:6:43
 
 export default function MenuItemTable({ menuItems, currentUser }) {
   const testid = "MenuItemTable";
-  const reviewCallback = async (_cell) => {
-    alert("Reviews coming soon!");
-  };
+  const reviewCallback = async (_cell) => {};
   const columns = [
     {
killedBy: MenuItemTable Tests Buttons work correctly
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:19:7
       accessor: "station",
     },
   ];
-  if (hasRole(currentUser, "ROLE_USER")) {
+  if (false) {
     columns.push(
       ButtonColumn("Review Item", "warning", reviewCallback, testid),
killedBy: MenuItemTable Tests Buttons work correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemTable-cell-row-0-col-Review Item-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:19:7
       accessor: "station",
     },
   ];
-  if (hasRole(currentUser, "ROLE_USER")) {
+  if (true) {
     columns.push(
       ButtonColumn("Review Item", "warning", reviewCallback, testid),
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly correctly without buttons
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-warning" data-testid="MenuItemTable-cell-row-0-col-Review Item-button" type="button">Review Item</button> instead

[Killed] StringLiteral
main/components/MenuItem/MenuItemTable.js:21:35
   ];
   if (hasRole(currentUser, "ROLE_USER")) {
     columns.push(
-      ButtonColumn("Review Item", "warning", reviewCallback, testid),
+      ButtonColumn("Review Item", "", reviewCallback, testid),
     );
   }
killedBy: MenuItemTable Tests Buttons work correctly
statusReason: Error: expect(element).toHaveClass("btn-warning")

Expected the element to have class:
  btn-warning
Received:
  btn
