[Killed] ObjectLiteral
main/components/Users/UsersTable.js:33:3
     Header: "Proposed Alias",
     accessor: "proposedAlias",
   },
-  {
-    Header: "Status",
-    accessor: (row) => {
-      if (row.status === "Approved" && row.dateApproved) {
-        const formattedDate = new Date(row.dateApproved).toLocaleDateString();
-        return `Approved on ${formattedDate}`;
-      }
-      return row.status;
-    },
-  },
+  {},
 ];
 
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.js:34:13
     accessor: "proposedAlias",
   },
   {
-    Header: "Status",
+    Header: "",
     accessor: (row) => {
       if (row.status === "Approved" && row.dateApproved) {
killedBy: UserTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Users/UsersTable.js:35:24
   },
   {
     Header: "Status",
-    accessor: (row) => {
-      if (row.status === "Approved" && row.dateApproved) {
-        const formattedDate = new Date(row.dateApproved).toLocaleDateString();
-        return `Approved on ${formattedDate}`;
-      }
-      return row.status;
-    },
+    accessor: (row) => {},
   },
 ];
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: TestingLibraryElementError: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="tab

[Killed] BlockStatement
main/components/Users/UsersTable.js:36:58
   {
     Header: "Status",
     accessor: (row) => {
-      if (row.status === "Approved" && row.dateApproved) {
-        const formattedDate = new Date(row.dateApproved).toLocaleDateString();
-        return `Approved on ${formattedDate}`;
-      }
+      if (row.status === "Approved" && row.dateApproved) {}
       return row.status;
     },
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: TestingLibraryElementError: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="tab

[Killed] EqualityOperator
main/components/Users/UsersTable.js:36:11
   {
     Header: "Status",
     accessor: (row) => {
-      if (row.status === "Approved" && row.dateApproved) {
+      if (row.status !== "Approved" && row.dateApproved) {
         const formattedDate = new Date(row.dateApproved).toLocaleDateString();
         return `Approved on ${formattedDate}`;
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: TestingLibraryElementError: Found multiple elements with the text: Approved

Here are the matching elements:

Ignored nodes: comments, script, style
<td
  data-testid="UsersTable-cell-row-0-col-Status"
  role="cell"

[Killed] StringLiteral
main/components/Users/UsersTable.js:38:16
     accessor: (row) => {
       if (row.status === "Approved" && row.dateApproved) {
         const formattedDate = new Date(row.dateApproved).toLocaleDateString();
-        return `Approved on ${formattedDate}`;
+        return ``;
       }
       return row.status;
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: TestingLibraryElementError: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="tab

[Killed] StringLiteral
main/components/Users/UsersTable.js:46:59
 ];
 
 export default function UsersTable({ users }) {
-  return <OurTable data={users} columns={columns} testid={"UsersTable"} />;
+  return <OurTable data={users} columns={columns} testid={""} />;
 }
 
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
