[Killed] StringLiteral
main/components/MenuItem/MenuItemTable.js:15:14
 
   const reviewCallback = (cell) => {
     const id = cell.row.original.id;
-    navigate(`/reviews/create/${id}`, {
+    navigate(``, {
       state: { from: location.pathname },
     });
killedBy: MenuItemTable Tests Review Item button navigates to create page with correct id and state
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "/reviews/create/undefined",
+ "",
  {"state": {"from": "/previous-page"}},

[Killed] ObjectLiteral
main/components/MenuItem/MenuItemTable.js:15:39
 
   const reviewCallback = (cell) => {
     const id = cell.row.original.id;
-    navigate(`/reviews/create/${id}`, {
-      state: { from: location.pathname },
-    });
+    navigate(`/reviews/create/${id}`, {});
   };
 
killedBy: MenuItemTable Tests Review Item button navigates to create page with correct id and state
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/reviews/create/undefined",
- Object {
-   "state": Object {

[Killed] StringLiteral
main/components/MenuItem/MenuItemTable.js:30:15
       accessor: "station",
     },
     {
-      Header: "Average Review",
+      Header: "",
       id: "averageReview",
       accessor: (row) => {
killedBy: MenuItemTable Tests Average Review column renders correct values
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Average Review
Received:

[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.js:32:26
     {
       Header: "Average Review",
       id: "averageReview",
-      accessor: (row) => {
-        const reviews = row.reviews;
-        if (!reviews) {
-          return "🤷‍♂️ No Rating";
-        }
-        const validRatings = reviews
-          .map((r) => {
-            const num = Number(r.itemsStars);
-            return isNaN(num) ? null : num;
-          })
-          .filter(
-            (stars) => Number.isFinite(stars) && stars >= 1 && stars <= 5,
-          );
-
-        if (validRatings.length === 0) {
-          return "🤷‍♂️ No Rating";
-        }
-
-        const avg =
-          validRatings.reduce((sum, stars) => sum + stars, 0) /
-          validRatings.length;
-
-        return `${avg.toFixed(1)} ⭐`;
-      },
+      accessor: (row) => {},
     },
   ];
killedBy: MenuItemTable Tests Average Review column renders correct values
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.0 ⭐
Received:

[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.js:34:23
       id: "averageReview",
       accessor: (row) => {
         const reviews = row.reviews;
-        if (!reviews) {
-          return "🤷‍♂️ No Rating";
-        }
+        if (!reviews) {}
         const validRatings = reviews
           .map((r) => {
killedBy: MenuItemTable Tests Average Review handles non-array reviews (Array.isArray false branch)
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:34:13
       id: "averageReview",
       accessor: (row) => {
         const reviews = row.reviews;
-        if (!reviews) {
+        if (true) {
           return "🤷‍♂️ No Rating";
         }
killedBy: MenuItemTable Tests Average Review column renders correct values
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.0 ⭐
Received:
  🤷‍♂️ No Rating

[Killed] MethodExpression
main/components/MenuItem/MenuItemTable.js:37:30
         if (!reviews) {
           return "🤷‍♂️ No Rating";
         }
-        const validRatings = reviews
-          .map((r) => {
-            const num = Number(r.itemsStars);
-            return isNaN(num) ? null : num;
-          })
-          .filter(
-            (stars) => Number.isFinite(stars) && stars >= 1 && stars <= 5,
-          );
+        const validRatings = reviews.map(r => {
+  const num = Number(r.itemsStars);
+  return isNaN(num) ? null : num;
+});
 
         if (validRatings.length === 0) {
killedBy: MenuItemTable Tests Average Review filters out non-numeric stars (isNaN branch)
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.0 ⭐
Received:
  2.7 ⭐

[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.js:38:23
           return "🤷‍♂️ No Rating";
         }
         const validRatings = reviews
-          .map((r) => {
-            const num = Number(r.itemsStars);
-            return isNaN(num) ? null : num;
-          })
+          .map((r) => {})
           .filter(
             (stars) => Number.isFinite(stars) && stars >= 1 && stars <= 5,
killedBy: MenuItemTable Tests Average Review column renders correct values
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.0 ⭐
Received:
  🤷‍♂️ No Rating

[Killed] LogicalOperator
main/components/MenuItem/MenuItemTable.js:43:24
             return isNaN(num) ? null : num;
           })
           .filter(
-            (stars) => Number.isFinite(stars) && stars >= 1 && stars <= 5,
+            (stars) => Number.isFinite(stars) && stars >= 1 || stars <= 5,
           );
 
killedBy: MenuItemTable Tests Average Review filters out non-numeric stars (isNaN branch)
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.0 ⭐
Received:
  2.7 ⭐

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:43:24
             return isNaN(num) ? null : num;
           })
           .filter(
-            (stars) => Number.isFinite(stars) && stars >= 1 && stars <= 5,
+            (stars) => false,
           );
 
killedBy: MenuItemTable Tests Average Review column renders correct values
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.0 ⭐
Received:
  🤷‍♂️ No Rating

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:46:13
             (stars) => Number.isFinite(stars) && stars >= 1 && stars <= 5,
           );
 
-        if (validRatings.length === 0) {
+        if (true) {
           return "🤷‍♂️ No Rating";
         }
killedBy: MenuItemTable Tests Average Review column renders correct values
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.0 ⭐
Received:
  🤷‍♂️ No Rating

[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.js:46:40
             (stars) => Number.isFinite(stars) && stars >= 1 && stars <= 5,
           );
 
-        if (validRatings.length === 0) {
-          return "🤷‍♂️ No Rating";
-        }
+        if (validRatings.length === 0) {}
 
         const avg =
killedBy: MenuItemTable Tests Average Review column renders correct values
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🤷‍♂️ No Rating
Received:
  NaN ⭐

[Killed] StringLiteral
main/components/MenuItem/MenuItemTable.js:47:18
           );
 
         if (validRatings.length === 0) {
-          return "🤷‍♂️ No Rating";
+          return ""
         }
 
killedBy: MenuItemTable Tests Average Review column renders correct values
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🤷‍♂️ No Rating
Received:

[Killed] ArithmeticOperator
main/components/MenuItem/MenuItemTable.js:51:11
         }
 
         const avg =
-          validRatings.reduce((sum, stars) => sum + stars, 0) /
-          validRatings.length;
+          validRatings.reduce((sum, stars) => sum + stars, 0) * validRatings.length;
 
         return `${avg.toFixed(1)} ⭐`;
killedBy: MenuItemTable Tests Average Review column renders correct values
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.0 ⭐
Received:
  36.0 ⭐

[Killed] ArrowFunction
main/components/MenuItem/MenuItemTable.js:51:31
         }
 
         const avg =
-          validRatings.reduce((sum, stars) => sum + stars, 0) /
+          validRatings.reduce(() => undefined, 0) /
           validRatings.length;
 
killedBy: MenuItemTable Tests Average Review column renders correct values
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.0 ⭐
Received:
  NaN ⭐
