[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.js:12:29
   const seen = new Set();
   const reviews = [];
 
-  const recurse = (node) => {
-    // known issue with Stryker on recursion with array checking
-    // Stryker disable next-line all : recursion
-    if (Array.isArray(node)) {
-      node.forEach(recurse);
-    } else if (node) {
-      if (seen.has(node)) return;
-      seen.add(node);
-
-      const isReviewForItem =
-        typeof node.itemsStars !== "undefined" &&
-        (node.item.id === itemId || node.item === itemId);
-
-      if (isReviewForItem) {
-        reviews.push(node);
-      }
-
-      Object.values(node).forEach(recurse);
-    }
-  };
+  const recurse = (node) => {};
 
   recurse(raw);
killedBy: MenuItemPage MenuItemPage renders average stars correctly for menu items
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5 ⭐
Received:
  🤷‍♂️ No Rating

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:17:16
     // Stryker disable next-line all : recursion
     if (Array.isArray(node)) {
       node.forEach(recurse);
-    } else if (node) {
+    } else if (true) {
       if (seen.has(node)) return;
       seen.add(node);
killedBy: MenuItemPage extractAllReviewsForItem edge cases skips nodes that are not objects
statusReason: TypeError: Cannot read properties of null (reading 'itemsStars')

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:17:16
     // Stryker disable next-line all : recursion
     if (Array.isArray(node)) {
       node.forEach(recurse);
-    } else if (node) {
+    } else if (false) {
       if (seen.has(node)) return;
       seen.add(node);
killedBy: MenuItemPage MenuItemPage renders average stars correctly for menu items
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5 ⭐
Received:
  🤷‍♂️ No Rating

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:18:11
     if (Array.isArray(node)) {
       node.forEach(recurse);
     } else if (node) {
-      if (seen.has(node)) return;
+      if (true) return;
       seen.add(node);
 
killedBy: MenuItemPage MenuItemPage renders average stars correctly for menu items
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5 ⭐
Received:
  🤷‍♂️ No Rating

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:18:11
     if (Array.isArray(node)) {
       node.forEach(recurse);
     } else if (node) {
-      if (seen.has(node)) return;
+      if (false) return;
       seen.add(node);
 
killedBy: MenuItemPage MenuItemPage handles invalid stars and mixed review data
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:22:9
       seen.add(node);
 
       const isReviewForItem =
-        typeof node.itemsStars !== "undefined" &&
-        (node.item.id === itemId || node.item === itemId);
+        false;
 
       if (isReviewForItem) {
killedBy: MenuItemPage MenuItemPage renders average stars correctly for menu items
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5 ⭐
Received:
  🤷‍♂️ No Rating

[Killed] EqualityOperator
main/components/MenuItem/MenuItemTable.js:22:9
       seen.add(node);
 
       const isReviewForItem =
-        typeof node.itemsStars !== "undefined" &&
+        typeof node.itemsStars === "undefined" &&
         (node.item.id === itemId || node.item === itemId);
 
killedBy: MenuItemPage MenuItemPage renders average stars correctly for menu items
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:23:10
 
       const isReviewForItem =
         typeof node.itemsStars !== "undefined" &&
-        (node.item.id === itemId || node.item === itemId);
+        (true);
 
       if (isReviewForItem) {
killedBy: MenuItemPage extractAllReviewsForItem edge cases matches both item.id === itemId and item === itemId
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    3,
    4,

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:23:37
 
       const isReviewForItem =
         typeof node.itemsStars !== "undefined" &&
-        (node.item.id === itemId || node.item === itemId);
+        (node.item.id === itemId || false);
 
       if (isReviewForItem) {
killedBy: MenuItemPage MenuItemPage renders average stars correctly for menu items
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5 ⭐
Received:
  🤷‍♂️ No Rating

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:25:11
         typeof node.itemsStars !== "undefined" &&
         (node.item.id === itemId || node.item === itemId);
 
-      if (isReviewForItem) {
+      if (true) {
         reviews.push(node);
       }
killedBy: MenuItemPage extractAllReviewsForItem edge cases handles circular references gracefully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 6

@@ -2,6 +2,12 @@
    Object {
      "id": 1,

[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.js:25:28
         typeof node.itemsStars !== "undefined" &&
         (node.item.id === itemId || node.item === itemId);
 
-      if (isReviewForItem) {
-        reviews.push(node);
-      }
+      if (isReviewForItem) {}
 
       Object.values(node).forEach(recurse);
killedBy: MenuItemPage MenuItemPage renders average stars correctly for menu items
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5 ⭐
Received:
  🤷‍♂️ No Rating

[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.js:42:36
   const navigate = useNavigate();
   const location = useLocation();
 
-  const reviewCallback = (cell) => {
-    const id = cell.row.original.id;
-    navigate(`/reviews/create/${id}`, {
-      state: { from: location.pathname },
-    });
-  };
+  const reviewCallback = (cell) => {};
 
   const columns = [
killedBy: MenuItemPage reviewCallback navigates correctly to the review creation page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/reviews/create/1", {"state": {"from": "/menu-items"}}

Number of calls: 0

[Killed] StringLiteral
main/components/MenuItem/MenuItemTable.js:52:17
   const columns = [
     {
       Header: "Item Name",
-      accessor: "name",
+      accessor: "",
     },
     {
killedBy: MenuItemPage Table headers render correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemTable-header-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.js:61:26
     {
       Header: "Average Review",
       id: "averageReview",
-      accessor: (row) => {
-        const extracted = extractAllReviewsForItem(row.reviews, row.id);
-
-        const validRatings = extracted
-          .map((r) => {
-            const num = Number(r.itemsStars);
-            return Number.isFinite(num) && num >= 1 && num <= 5 ? num : null;
-          })
-          .filter((num) => num !== null);
-
-        if (validRatings.length === 0) {
-          return "🤷‍♂️ No Rating";
-        }
-
-        let total = 0;
-        for (const stars of validRatings) {
-          total = total + stars;
-        }
-        const avg = total / validRatings.length;
-        return `${avg.toFixed(1)} ⭐`;
-      },
+      accessor: (row) => {},
     },
   ];
killedBy: MenuItemPage MenuItemPage renders average stars correctly for menu items
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5 ⭐
Received:

[Killed] MethodExpression
main/components/MenuItem/MenuItemTable.js:64:30
       accessor: (row) => {
         const extracted = extractAllReviewsForItem(row.reviews, row.id);
 
-        const validRatings = extracted
-          .map((r) => {
-            const num = Number(r.itemsStars);
-            return Number.isFinite(num) && num >= 1 && num <= 5 ? num : null;
-          })
-          .filter((num) => num !== null);
+        const validRatings = extracted.map(r => {
+  const num = Number(r.itemsStars);
+  return Number.isFinite(num) && num >= 1 && num <= 5 ? num : null;
+});
 
         if (validRatings.length === 0) {
killedBy: MenuItemPage MenuItemPage handles invalid stars and mixed review data
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  3.0 ⭐
Received:
  0.8 ⭐

[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.js:65:23
         const extracted = extractAllReviewsForItem(row.reviews, row.id);
 
         const validRatings = extracted
-          .map((r) => {
-            const num = Number(r.itemsStars);
-            return Number.isFinite(num) && num >= 1 && num <= 5 ? num : null;
-          })
+          .map((r) => {})
           .filter((num) => num !== null);
 
killedBy: MenuItemPage MenuItemPage renders average stars correctly for menu items
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5 ⭐
Received:
  NaN ⭐

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:67:20
         const validRatings = extracted
           .map((r) => {
             const num = Number(r.itemsStars);
-            return Number.isFinite(num) && num >= 1 && num <= 5 ? num : null;
+            return true ? num : null;
           })
           .filter((num) => num !== null);
killedBy: MenuItemPage MenuItemPage handles invalid stars and mixed review data
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  3.0 ⭐
Received:
  NaN ⭐

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:67:20
         const validRatings = extracted
           .map((r) => {
             const num = Number(r.itemsStars);
-            return Number.isFinite(num) && num >= 1 && num <= 5 ? num : null;
+            return true && num <= 5 ? num : null;
           })
           .filter((num) => num !== null);
killedBy: MenuItemPage MenuItemPage handles invalid stars and mixed review data
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  3.0 ⭐
Received:
  1.5 ⭐

[Killed] EqualityOperator
main/components/MenuItem/MenuItemTable.js:69:28
             const num = Number(r.itemsStars);
             return Number.isFinite(num) && num >= 1 && num <= 5 ? num : null;
           })
-          .filter((num) => num !== null);
+          .filter((num) => num === null);
 
         if (validRatings.length === 0) {
killedBy: MenuItemPage MenuItemPage renders average stars correctly for menu items
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5 ⭐
Received:
  🤷‍♂️ No Rating

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:69:28
             const num = Number(r.itemsStars);
             return Number.isFinite(num) && num >= 1 && num <= 5 ? num : null;
           })
-          .filter((num) => num !== null);
+          .filter((num) => false);
 
         if (validRatings.length === 0) {
killedBy: MenuItemPage MenuItemPage renders average stars correctly for menu items
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5 ⭐
Received:
  🤷‍♂️ No Rating

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:71:13
           })
           .filter((num) => num !== null);
 
-        if (validRatings.length === 0) {
+        if (false) {
           return "🤷‍♂️ No Rating";
         }
killedBy: MenuItemPage MenuItemPage renders average stars correctly for menu items
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🤷‍♂️ No Rating
Received:
  NaN ⭐

[Killed] EqualityOperator
main/components/MenuItem/MenuItemTable.js:71:13
           })
           .filter((num) => num !== null);
 
-        if (validRatings.length === 0) {
+        if (validRatings.length !== 0) {
           return "🤷‍♂️ No Rating";
         }
killedBy: MenuItemPage MenuItemPage renders average stars correctly for menu items
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5 ⭐
Received:
  🤷‍♂️ No Rating

[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.js:76:43
         }
 
         let total = 0;
-        for (const stars of validRatings) {
-          total = total + stars;
-        }
+        for (const stars of validRatings) {}
         const avg = total / validRatings.length;
         return `${avg.toFixed(1)} ⭐`;
killedBy: MenuItemPage MenuItemPage renders average stars correctly for menu items
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5 ⭐
Received:
  0.0 ⭐

[Killed] ArithmeticOperator
main/components/MenuItem/MenuItemTable.js:77:19
 
         let total = 0;
         for (const stars of validRatings) {
-          total = total + stars;
+          total = total - stars;
         }
         const avg = total / validRatings.length;
killedBy: MenuItemPage average is positive and equal to the expected value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArithmeticOperator
main/components/MenuItem/MenuItemTable.js:79:21
         for (const stars of validRatings) {
           total = total + stars;
         }
-        const avg = total / validRatings.length;
+        const avg = total * validRatings.length;
         return `${avg.toFixed(1)} ⭐`;
       },
killedBy: MenuItemPage MenuItemPage renders average stars correctly for menu items
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5 ⭐
Received:
  18.0 ⭐

[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.js:85:42
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_USER")) {
-    columns.push(
-      ButtonColumn("Review Item", "warning", reviewCallback, testid),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_USER")) {}
 
   return <OurTable columns={columns} data={menuItems} testid={testid} />;
killedBy: MenuItemPage MenuItemPage renders review button and navigates on click
statusReason: Error: Unable to find role="button" and name `/Review Item/i`

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:85:7
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_USER")) {
+  if (true) {
     columns.push(
       ButtonColumn("Review Item", "warning", reviewCallback, testid),
killedBy: MenuItemPage does NOT render Review Item button if user does NOT have ROLE_USER
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-warning" data-testid="MenuItemTable-cell-row-0-col-Review Item-button" type="button">Review Item</button> instead
