[Killed] LogicalOperator
main/pages/ReviewsPage/CreateReviewsPage.js:12:14
 
 export default function CreateReviewPage({ id: idFromProps }) {
   const { id: idFromRoute } = useParams();
-  const id = idFromProps ?? idFromRoute;
+  const id = idFromProps && idFromRoute;
   const { data: currentUser } = useCurrentUser();
   const navigate = useNavigate();
killedBy: CreateReviewPage branch coverage passes initialContents and hides Item ID when idParam present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"itemId\":\"7\",\"stars\":\"\",\"comments\":\"\"}"
Received: "{\"itemId\":\"\",\"stars\":\"\",\"comments\":\"\"}"

[Killed] ConditionalExpression
main/pages/ReviewsPage/CreateReviewsPage.js:16:16
   const { data: currentUser } = useCurrentUser();
   const navigate = useNavigate();
   const location = useLocation();
-  const from = location.state?.from || "/reviews/create";
+  const from = false;
 
   const submitAction = async (formData) => {
killedBy: CreateReviewPage branch coverage submits successfully using item.name and trims comments
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/came-from"
Received: false

Number of calls: 1

[Killed] LogicalOperator
main/pages/ReviewsPage/CreateReviewsPage.js:16:16
   const { data: currentUser } = useCurrentUser();
   const navigate = useNavigate();
   const location = useLocation();
-  const from = location.state?.from || "/reviews/create";
+  const from = location.state?.from && "/reviews/create";
 
   const submitAction = async (formData) => {
killedBy: CreateReviewPage branch coverage submits successfully using item.name and trims comments
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/came-from"
Received: "/reviews/create"

Number of calls: 1

[Killed] ConditionalExpression
main/pages/ReviewsPage/CreateReviewsPage.js:20:7
 
   const submitAction = async (formData) => {
     const reviewerEmail =
-      currentUser &&
-      currentUser.root &&
-      currentUser.root.user &&
-      currentUser.root.user.email;
+      true;
 
     if (!reviewerEmail) {
killedBy: CreateReviewPage branch coverage refuses to submit when not logged in
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "You must be logged in to submit a review."

Number of calls: 0

[Killed] ConditionalExpression
main/pages/ReviewsPage/CreateReviewsPage.js:20:7
 
   const submitAction = async (formData) => {
     const reviewerEmail =
-      currentUser &&
-      currentUser.root &&
-      currentUser.root.user &&
+      true &&
       currentUser.root.user.email;
 
killedBy: CreateReviewPage branch coverage refuses to submit when not logged in
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "You must be logged in to submit a review."

Number of calls: 0

[Killed] BlockStatement
main/pages/ReviewsPage/CreateReviewsPage.js:25:25
       currentUser.root.user &&
       currentUser.root.user.email;
 
-    if (!reviewerEmail) {
-      toast.error("You must be logged in to submit a review.");
-      return;
-    }
+    if (!reviewerEmail) {}
 
     const itemId = id ? parseInt(id, 10) : parseInt(formData.itemId, 10);
killedBy: CreateReviewPage branch coverage refuses to submit when not logged in
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "You must be logged in to submit a review."

Number of calls: 0

[Killed] ConditionalExpression
main/pages/ReviewsPage/CreateReviewsPage.js:25:9
       currentUser.root.user &&
       currentUser.root.user.email;
 
-    if (!reviewerEmail) {
+    if (true) {
       toast.error("You must be logged in to submit a review.");
       return;
killedBy: CreateReviewPage branch coverage submits successfully using item.name and trims comments
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/ReviewsPage/CreateReviewsPage.js:26:19
       currentUser.root.user.email;
 
     if (!reviewerEmail) {
-      toast.error("You must be logged in to submit a review.");
+      toast.error("");
       return;
     }
killedBy: CreateReviewPage branch coverage refuses to submit when not logged in
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "You must be logged in to submit a review."
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/pages/ReviewsPage/CreateReviewsPage.js:48:27
       });
 
       const review = response.data;
-      const displayName = review.item?.name || `Menu Item #${itemId}`;
+      const displayName = true;
       const rating = review.itemsStars;
       const comment =
killedBy: CreateReviewPage branch coverage submits successfully using item.name and trims comments
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "✅ Review submitted for \"Named Dish\"
⭐ Rating: 3
💬 Comment: Great!",

[Killed] OptionalChaining
main/pages/ReviewsPage/CreateReviewsPage.js:48:27
       });
 
       const review = response.data;
-      const displayName = review.item?.name || `Menu Item #${itemId}`;
+      const displayName = review.item.name || `Menu Item #${itemId}`;
       const rating = review.itemsStars;
       const comment =
killedBy: CreateReviewPage branch coverage falls back to 'Menu Item #...' when review.item is undefined (kills optional chaining on .item?.name)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "✅ Review submitted for \"Menu Item #77\"
⭐ Rating: 2
💬 Comment: Decent", {"autoClose": 8000}

Number of calls: 0

[Killed] ConditionalExpression
main/pages/ReviewsPage/CreateReviewsPage.js:51:9
       const displayName = review.item?.name || `Menu Item #${itemId}`;
       const rating = review.itemsStars;
       const comment =
-        review.reviewerComments?.trim() || "No comments provided.";
+        false;
 
       toast.success(
killedBy: CreateReviewPage branch coverage submits successfully using item.name and trims comments
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "✅ Review submitted for \"Named Dish\"
⭐ Rating: 3
💬 Comment: Great!",

[Killed] MethodExpression
main/pages/ReviewsPage/CreateReviewsPage.js:51:9
       const displayName = review.item?.name || `Menu Item #${itemId}`;
       const rating = review.itemsStars;
       const comment =
-        review.reviewerComments?.trim() || "No comments provided.";
+        review.reviewerComments || "No comments provided.";
 
       toast.success(
killedBy: CreateReviewPage branch coverage submits successfully using item.name and trims comments
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "✅ Review submitted for \"Named Dish\"
⭐ Rating: 3
💬 Comment: Great!",

[Killed] BlockStatement
main/pages/ReviewsPage/CreateReviewsPage.js:58:24
         { autoClose: 8000 },
       );
 
-      setTimeout(() => {
-        navigate(from);
-      }, 1000);
+      setTimeout(() => {}, 1000);
     } catch (e) {
       console.error(e);
killedBy: CreateReviewPage branch coverage submits successfully using item.name and trims comments
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/came-from"

Number of calls: 0

[Killed] BlockStatement
main/pages/ReviewsPage/CreateReviewsPage.js:61:17
       setTimeout(() => {
         navigate(from);
       }, 1000);
-    } catch (e) {
-      console.error(e);
-      const message = e.response?.data?.message || e.response?.data?.error;
-      if (e.response?.status === 404 && message.includes("MenuItem")) {
-        toast.error(`Menu item with ID ${itemId} not found.`);
-      } else {
-        toast.error("Error creating review.");
-      }
-    }
+    } catch (e) {}
   };
 
killedBy: CreateReviewPage branch coverage shows 'not found' error on 404 + 'MenuItem'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Menu item with ID 88 not found."

Number of calls: 0

[Killed] OptionalChaining
main/pages/ReviewsPage/CreateReviewsPage.js:63:52
       }, 1000);
     } catch (e) {
       console.error(e);
-      const message = e.response?.data?.message || e.response?.data?.error;
+      const message = e.response?.data?.message || e.response.data?.error;
       if (e.response?.status === 404 && message.includes("MenuItem")) {
         toast.error(`Menu item with ID ${itemId} not found.`);
killedBy: CreateReviewPage branch coverage falls back to generic error when no response object
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error creating review."

Number of calls: 0

[Killed] OptionalChaining
main/pages/ReviewsPage/CreateReviewsPage.js:63:23
       }, 1000);
     } catch (e) {
       console.error(e);
-      const message = e.response?.data?.message || e.response?.data?.error;
+      const message = e.response?.data.message || e.response?.data?.error;
       if (e.response?.status === 404 && message.includes("MenuItem")) {
         toast.error(`Menu item with ID ${itemId} not found.`);
killedBy: CreateReviewPage branch coverage handles null data property safely
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error creating review."

Number of calls: 0

[Killed] EqualityOperator
main/pages/ReviewsPage/CreateReviewsPage.js:64:11
     } catch (e) {
       console.error(e);
       const message = e.response?.data?.message || e.response?.data?.error;
-      if (e.response?.status === 404 && message.includes("MenuItem")) {
+      if (e.response?.status !== 404 && message.includes("MenuItem")) {
         toast.error(`Menu item with ID ${itemId} not found.`);
       } else {
killedBy: CreateReviewPage branch coverage shows 'not found' error on 404 + 'MenuItem'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Menu item with ID 88 not found."
Received: "Error creating review."

Number of calls: 1

[Killed] ConditionalExpression
main/pages/ReviewsPage/CreateReviewsPage.js:64:11
     } catch (e) {
       console.error(e);
       const message = e.response?.data?.message || e.response?.data?.error;
-      if (e.response?.status === 404 && message.includes("MenuItem")) {
+      if (false) {
         toast.error(`Menu item with ID ${itemId} not found.`);
       } else {
killedBy: CreateReviewPage branch coverage shows 'not found' error on 404 + 'MenuItem'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Menu item with ID 88 not found."
Received: "Error creating review."

Number of calls: 1

[Killed] StringLiteral
main/pages/ReviewsPage/CreateReviewsPage.js:65:21
       console.error(e);
       const message = e.response?.data?.message || e.response?.data?.error;
       if (e.response?.status === 404 && message.includes("MenuItem")) {
-        toast.error(`Menu item with ID ${itemId} not found.`);
+        toast.error(``);
       } else {
         toast.error("Error creating review.");
killedBy: CreateReviewPage branch coverage shows 'not found' error on 404 + 'MenuItem'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Menu item with ID 88 not found."
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/pages/ReviewsPage/CreateReviewsPage.js:66:14
       const message = e.response?.data?.message || e.response?.data?.error;
       if (e.response?.status === 404 && message.includes("MenuItem")) {
         toast.error(`Menu item with ID ${itemId} not found.`);
-      } else {
-        toast.error("Error creating review.");
-      }
+      } else {}
     }
   };
killedBy: CreateReviewPage branch coverage falls back to generic error on 404 without 'MenuItem'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error creating review."

Number of calls: 0

[Killed] StringLiteral
main/pages/ReviewsPage/CreateReviewsPage.js:67:21
       if (e.response?.status === 404 && message.includes("MenuItem")) {
         toast.error(`Menu item with ID ${itemId} not found.`);
       } else {
-        toast.error("Error creating review.");
+        toast.error("");
       }
     }
killedBy: CreateReviewPage branch coverage falls back to generic error on 404 without 'MenuItem'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error creating review."
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/pages/ReviewsPage/CreateReviewsPage.js:73:13
   };
 
   const initialContents = {
-    itemId: id || "",
+    itemId: false,
     stars: "",
     comments: "",
killedBy: CreateReviewPage branch coverage passes initialContents and shows Item ID when no idParam
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"itemId\":\"\",\"stars\":\"\",\"comments\":\"\"}"
Received: "{\"itemId\":false,\"stars\":\"\",\"comments\":\"\"}"

[Killed] LogicalOperator
main/pages/ReviewsPage/CreateReviewsPage.js:73:13
   };
 
   const initialContents = {
-    itemId: id || "",
+    itemId: id && "",
     stars: "",
     comments: "",
killedBy: CreateReviewPage branch coverage passes initialContents and shows Item ID when no idParam
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"itemId\":\"\",\"stars\":\"\",\"comments\":\"\"}"
Received: "{\"stars\":\"\",\"comments\":\"\"}"

[Killed] StringLiteral
main/pages/ReviewsPage/CreateReviewsPage.js:74:12
 
   const initialContents = {
     itemId: id || "",
-    stars: "",
+    stars: "Stryker was here!",
     comments: "",
   };
killedBy: CreateReviewPage branch coverage passes initialContents and shows Item ID when no idParam
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"itemId\":\"\",\"stars\":\"\",\"comments\":\"\"}"
Received: "{\"itemId\":\"\",\"stars\":\"Stryker was here!\",\"comments\":\"\"}"

[Killed] BooleanLiteral
main/pages/ReviewsPage/CreateReviewsPage.js:86:23
           initialContents={initialContents}
           submitAction={submitAction}
           buttonLabel="Submit Review"
-          hideItemId={!!id}
+          hideItemId={!id}
         />
       </div>
killedBy: CreateReviewPage branch coverage passes initialContents and shows Item ID when no idParam
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "false"
Received: "true"
