[Killed] BooleanLiteral
main/components/MenuItemReviews/ReviewForm.js:11:16
   initialContents,
   submitAction,
   buttonLabel = "Create",
-  hideItemId = false,
+  hideItemId = true,
 }) {
   const {
killedBy: ReviewForm: full branch coverage including Cancel shows Menu Item ID input by default when hideItemId not passed
statusReason: TestingLibraryElementError: Unable to find a label with the text of: /Menu Item ID/i

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReviews/ReviewForm.js:22:9
   const navigate = useNavigate();
 
   const renderItemInput = () => {
-    if (hideItemId) return null;
+    if (true) return null;
 
     return (
killedBy: ReviewForm: full branch coverage including Cancel shows 'required' errors and prevents submit when fields empty
statusReason: Error: Unable to find an element with the text: /Menu item ID is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReviews/ReviewForm.js:22:9
   const navigate = useNavigate();
 
   const renderItemInput = () => {
-    if (hideItemId) return null;
+    if (false) return null;
 
     return (
killedBy: ReviewForm: full branch coverage including Cancel hides the Menu Item ID input when hideItemId=true
statusReason: Error: expect(received).toBeNull()

Received: <input class="form-control" id="itemId" min="1" name="itemId" step="1" type="number" />

[Killed] ObjectLiteral
main/components/MenuItemReviews/ReviewForm.js:33:34
           min="1"
           step="1"
           isInvalid={Boolean(errors.itemId)}
-          {...register("itemId", {
-            required: "Menu item ID is required.",
-            validate: (value) =>
-              Number.isInteger(Number(value)) && Number(value) > 0
-                ? true
-                : "Item ID must be a positive integer.",
-          })}
+          {...register("itemId", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ReviewForm: full branch coverage including Cancel shows 'required' errors and prevents submit when fields empty
statusReason: Error: Unable to find an element with the text: /Menu item ID is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/ReviewForm.js:34:23
           step="1"
           isInvalid={Boolean(errors.itemId)}
           {...register("itemId", {
-            required: "Menu item ID is required.",
+            required: "",
             validate: (value) =>
               Number.isInteger(Number(value)) && Number(value) > 0
killedBy: ReviewForm: full branch coverage including Cancel shows 'required' errors and prevents submit when fields empty
statusReason: Error: Unable to find an element with the text: /Menu item ID is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrowFunction
main/components/MenuItemReviews/ReviewForm.js:35:23
           isInvalid={Boolean(errors.itemId)}
           {...register("itemId", {
             required: "Menu item ID is required.",
-            validate: (value) =>
-              Number.isInteger(Number(value)) && Number(value) > 0
-                ? true
-                : "Item ID must be a positive integer.",
+            validate: () => undefined,
           })}
         />
killedBy: ReviewForm: full branch coverage including Cancel validates itemId: non-integer, zero, negative => positive-integer error
statusReason: Error: Unable to find an element with the text: /Item ID must be a positive integer/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReviews/ReviewForm.js:36:50
           {...register("itemId", {
             required: "Menu item ID is required.",
             validate: (value) =>
-              Number.isInteger(Number(value)) && Number(value) > 0
+              Number.isInteger(Number(value)) && true
                 ? true
                 : "Item ID must be a positive integer.",
killedBy: ReviewForm: full branch coverage including Cancel shows error if item ID is 0, negative, or non-integer
statusReason: Error: Unable to find an element with the text: /positive integer/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] EqualityOperator
main/components/MenuItemReviews/ReviewForm.js:36:50
           {...register("itemId", {
             required: "Menu item ID is required.",
             validate: (value) =>
-              Number.isInteger(Number(value)) && Number(value) > 0
+              Number.isInteger(Number(value)) && Number(value) <= 0
                 ? true
                 : "Item ID must be a positive integer.",
killedBy: ReviewForm: full branch coverage including Cancel submits successfully with valid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
main/components/MenuItemReviews/ReviewForm.js:37:19
             required: "Menu item ID is required.",
             validate: (value) =>
               Number.isInteger(Number(value)) && Number(value) > 0
-                ? true
+                ? false
                 : "Item ID must be a positive integer.",
           })}
killedBy: ReviewForm: full branch coverage including Cancel submits successfully with valid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/MenuItemReviews/ReviewForm.js:38:19
             validate: (value) =>
               Number.isInteger(Number(value)) && Number(value) > 0
                 ? true
-                : "Item ID must be a positive integer.",
+                : "",
           })}
         />
killedBy: ReviewForm: full branch coverage including Cancel validates itemId: non-integer, zero, negative => positive-integer error
statusReason: Error: Unable to find an element with the text: /Item ID must be a positive integer/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/MenuItemReviews/ReviewForm.js:50:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents?.id && (
+      {initialContents.id && (
         <Form.Group className="mb-3">
           <Form.Label htmlFor="id">Id</Form.Label>
killedBy: ReviewForm: full branch coverage including Cancel shows 'required' errors and prevents submit when fields empty
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
main/components/MenuItemReviews/ReviewForm.js:50:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents?.id && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialContents?.id || <Form.Group className="mb-3">
+          <Form.Label htmlFor="id">Id</Form.Label>
+          <Form.Control id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+        </Form.Group>}
 
       {renderItemInput()}
killedBy: ReviewForm: full branch coverage including Cancel renders a disabled id field when initialContents.id is provided
statusReason: TestingLibraryElementError: Unable to find an element with the display value: ABC123.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrowFunction
main/components/MenuItemReviews/ReviewForm.js:80:23
             required: "Stars is required.",
             min: { value: 1, message: "Minimum 1 star" },
             max: { value: 5, message: "Maximum 5 stars" },
-            validate: (v) =>
-              Number.isInteger(Number(v)) || "Please enter a whole number.",
+            validate: () => undefined,
           })}
         />
killedBy: ReviewForm: full branch coverage including Cancel validates stars: below 1, above 5, non-integer
statusReason: Error: Unable to find an element with the text: /Please enter a whole number/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReviews/ReviewForm.js:81:15
             min: { value: 1, message: "Minimum 1 star" },
             max: { value: 5, message: "Maximum 5 stars" },
             validate: (v) =>
-              Number.isInteger(Number(v)) || "Please enter a whole number.",
+              false,
           })}
         />
killedBy: ReviewForm: full branch coverage including Cancel validates stars: below 1, above 5, non-integer
statusReason: Error: Unable to find an element with the text: /Please enter a whole number/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/MenuItemReviews/ReviewForm.js:81:15
             min: { value: 1, message: "Minimum 1 star" },
             max: { value: 5, message: "Maximum 5 stars" },
             validate: (v) =>
-              Number.isInteger(Number(v)) || "Please enter a whole number.",
+              Number.isInteger(Number(v)) && "Please enter a whole number.",
           })}
         />
killedBy: ReviewForm: full branch coverage including Cancel validates stars: below 1, above 5, non-integer
statusReason: Error: Unable to find an element with the text: /Please enter a whole number/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/ReviewForm.js:101:24
           {...register("comments", {
             maxLength: {
               value: 255,
-              message: "Max length is 255 characters",
+              message: "",
             },
           })}
killedBy: ReviewForm: full branch coverage including Cancel validates comments max length of 255
statusReason: Error: Unable to find an element with the text: /Max length is 255 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] UnaryOperator
main/components/MenuItemReviews/ReviewForm.js:112:76
       </Form.Group>
 
       <Button type="submit">{buttonLabel}</Button>
-      <Button variant="secondary" className="ms-2" onClick={() => navigate(-1)}>
+      <Button variant="secondary" className="ms-2" onClick={() => navigate(+1)}>
         Cancel
       </Button>
killedBy: ReviewForm: full branch coverage including Cancel navigates back when Cancel is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1
Received: 1

Number of calls: 1

[Killed] ArrowFunction
main/components/MenuItemReviews/ReviewForm.js:112:61
       </Form.Group>
 
       <Button type="submit">{buttonLabel}</Button>
-      <Button variant="secondary" className="ms-2" onClick={() => navigate(-1)}>
+      <Button variant="secondary" className="ms-2" onClick={() => undefined}>
         Cancel
       </Button>
killedBy: ReviewForm: full branch coverage including Cancel navigates back when Cancel is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1

Number of calls: 0
