[Killed] ConditionalExpression
main/pages/MenuItem/MenuItemPage.js:27:7
     [],
   );
 
-  if (!meal || !date || !diningCommons) {
+  if (false || !diningCommons) {
     return (
       <BasicLayout>
killedBy: MenuItemPage shows loading when meal parameter is missing
statusReason: TypeError: Cannot read properties of null (reading 'at')
