[Killed] ConditionalExpression
main/pages/Meal/MealTimesPage.js:23:7
     [],
   );
 
-  if (!dateTime || !diningCommonsCode) {
+  if (true) {
     return (
       <BasicLayout>
killedBy: MealTimesPage tests displays correct information in the table
statusReason: Error: Unable to find an element with the text: Meals at portola for 2024-11-25. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Meal/MealTimesPage.js:23:7
     [],
   );
 
-  if (!dateTime || !diningCommonsCode) {
+  if (false) {
     return (
       <BasicLayout>
killedBy: MealTimesPage tests shows loading when dateTime is missing
statusReason: TestingLibraryElementError: Unable to find an element with the text: Loading.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
