[Killed] LogicalOperator
main/pages/MenuItem/MenuItemPage.js:27:7
     [],
   );
 
-  if (!meal || !date || !diningCommons) {
+  if ((!meal || !date) && !diningCommons) {
     return (
       <BasicLayout>
killedBy: MenuItemPage shows loading when meal parameter is missing
statusReason: TypeError: Cannot read properties of null (reading 'at')

[Killed] ConditionalExpression
main/pages/MenuItem/MenuItemPage.js:27:7
     [],
   );
 
-  if (!meal || !date || !diningCommons) {
+  if (false) {
     return (
       <BasicLayout>
killedBy: MenuItemPage shows loading when meal parameter is missing
statusReason: TypeError: Cannot read properties of null (reading 'at')
