[Killed] BlockStatement
src/main/pages/Moderate.js:6:24
 import { Navigate } from "react-router-dom";
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-const Moderate = () => {
-  const { data: currentUser } = useCurrentUser();
-
-  if (
-    !currentUser.loggedIn ||
-    !(
-      hasRole(currentUser, "ROLE_ADMIN") ||
-      hasRole(currentUser, "ROLE_MODERATOR")
-    )
-  ) {
-    return <Navigate to="/" />;
-  }
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Moderation Page</h1>
-        <p>This page is accessible only to admins. (Placeholder)</p>
-      </div>
-    </BasicLayout>
-  );
-};
+const Moderate = () => {};
 
 export default Moderate;
killedBy: ModeratePage tests renders correctly for admin user
statusReason: Error: Unable to find an element with the text: Moderation Page. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/main/pages/Moderate.js:10:5
   const { data: currentUser } = useCurrentUser();
 
   if (
-    !currentUser.loggedIn ||
-    !(
-      hasRole(currentUser, "ROLE_ADMIN") ||
-      hasRole(currentUser, "ROLE_MODERATOR")
-    )
+    !currentUser.loggedIn && !(hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_MODERATOR"))
   ) {
     return <Navigate to="/" />;
killedBy: ModeratePage tests redirects user with invalid moderator role name
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>Moderation Page</h1> instead

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Killed] ConditionalExpression
src/main/pages/Moderate.js:10:5
   const { data: currentUser } = useCurrentUser();
 
   if (
-    !currentUser.loggedIn ||
-    !(
-      hasRole(currentUser, "ROLE_ADMIN") ||
-      hasRole(currentUser, "ROLE_MODERATOR")
-    )
+    false
   ) {
     return <Navigate to="/" />;
killedBy: ModeratePage tests redirects user with invalid moderator role name
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>Moderation Page</h1> instead

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Killed] BooleanLiteral
src/main/pages/Moderate.js:11:5
 
   if (
     !currentUser.loggedIn ||
-    !(
-      hasRole(currentUser, "ROLE_ADMIN") ||
-      hasRole(currentUser, "ROLE_MODERATOR")
-    )
+    hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_MODERATOR")
   ) {
     return <Navigate to="/" />;
killedBy: ModeratePage tests renders correctly for admin user
statusReason: Error: Unable to find an element with the text: Moderation Page. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/main/pages/Moderate.js:12:7
   if (
     !currentUser.loggedIn ||
     !(
-      hasRole(currentUser, "ROLE_ADMIN") ||
-      hasRole(currentUser, "ROLE_MODERATOR")
+      hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_MODERATOR")
     )
   ) {
killedBy: ModeratePage tests renders correctly for admin user
statusReason: Error: Unable to find an element with the text: Moderation Page. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/main/pages/Moderate.js:12:7
   if (
     !currentUser.loggedIn ||
     !(
-      hasRole(currentUser, "ROLE_ADMIN") ||
-      hasRole(currentUser, "ROLE_MODERATOR")
+      false
     )
   ) {
killedBy: ModeratePage tests renders correctly for admin user
statusReason: Error: Unable to find an element with the text: Moderation Page. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/main/pages/Moderate.js:15:5
       hasRole(currentUser, "ROLE_ADMIN") ||
       hasRole(currentUser, "ROLE_MODERATOR")
     )
-  ) {
-    return <Navigate to="/" />;
-  }
+  ) {}
 
   return (
killedBy: ModeratePage tests redirects user with invalid moderator role name
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>Moderation Page</h1> instead

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
