[Killed] BooleanLiteral
main/pages/ReviewsPage/CreateReviewsPage.js:19:55
   const from = location.state?.from || "/reviews/create";
 
   const [itemName, setItemName] = useState("");
-  const [isLoadingItem, setIsLoadingItem] = useState(!!id);
+  const [isLoadingItem, setIsLoadingItem] = useState(!id);
 
   // Fetch item name if we have an ID
killedBy: CreateReviewPage branch coverage passes initialContents with dateServed field when no idParam
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="initial-contents"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="pt-2"

[Killed] BlockStatement
main/pages/ReviewsPage/CreateReviewsPage.js:22:19
   const [isLoadingItem, setIsLoadingItem] = useState(!!id);
 
   // Fetch item name if we have an ID
-  useEffect(() => {
-    if (id) {
-      const fetchItemName = async () => {
-        try {
-          const response = await axios.get(
-            `/api/diningcommons/menuitem?id=${id}`,
-          );
-          setItemName(response.data.name || `Menu Item #${id}`);
-        } catch (error) {
-          console.error("Error fetching item:", error);
-          setItemName(`Menu Item #${id}`);
-        } finally {
-          setIsLoadingItem(false);
-        }
-      };
-
-      fetchItemName();
-    }
-  }, [id]);
+  useEffect(() => {}, [id]);
 
   const submitAction = async (formData) => {
killedBy: CreateReviewPage branch coverage fetches item name and passes it to ReviewForm when idParam present
statusReason: Error: Unable to find an element by: [data-testid="item-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="pt-2"

[Killed] BlockStatement
main/pages/ReviewsPage/CreateReviewsPage.js:23:13
 
   // Fetch item name if we have an ID
   useEffect(() => {
-    if (id) {
-      const fetchItemName = async () => {
-        try {
-          const response = await axios.get(
-            `/api/diningcommons/menuitem?id=${id}`,
-          );
-          setItemName(response.data.name || `Menu Item #${id}`);
-        } catch (error) {
-          console.error("Error fetching item:", error);
-          setItemName(`Menu Item #${id}`);
-        } finally {
-          setIsLoadingItem(false);
-        }
-      };
-
-      fetchItemName();
-    }
+    if (id) {}
   }, [id]);
 
killedBy: CreateReviewPage branch coverage fetches item name and passes it to ReviewForm when idParam present
statusReason: Error: Unable to find an element by: [data-testid="item-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="pt-2"

[Killed] BlockStatement
main/pages/ReviewsPage/CreateReviewsPage.js:24:41
   // Fetch item name if we have an ID
   useEffect(() => {
     if (id) {
-      const fetchItemName = async () => {
-        try {
-          const response = await axios.get(
-            `/api/diningcommons/menuitem?id=${id}`,
-          );
-          setItemName(response.data.name || `Menu Item #${id}`);
-        } catch (error) {
-          console.error("Error fetching item:", error);
-          setItemName(`Menu Item #${id}`);
-        } finally {
-          setIsLoadingItem(false);
-        }
-      };
+      const fetchItemName = async () => {};
 
       fetchItemName();
killedBy: CreateReviewPage branch coverage fetches item name and passes it to ReviewForm when idParam present
statusReason: Error: Unable to find an element by: [data-testid="item-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="pt-2"

[Killed] BlockStatement
main/pages/ReviewsPage/CreateReviewsPage.js:25:13
   useEffect(() => {
     if (id) {
       const fetchItemName = async () => {
-        try {
-          const response = await axios.get(
-            `/api/diningcommons/menuitem?id=${id}`,
-          );
-          setItemName(response.data.name || `Menu Item #${id}`);
-        } catch (error) {
+        try {} catch (error) {
           console.error("Error fetching item:", error);
           setItemName(`Menu Item #${id}`);
killedBy: CreateReviewPage branch coverage fetches item name and passes it to ReviewForm when idParam present
statusReason: TestingLibraryElementError: Unable to find an element with the text: Loading item information.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="pt-2"

[Killed] ConditionalExpression
main/pages/ReviewsPage/CreateReviewsPage.js:29:23
           const response = await axios.get(
             `/api/diningcommons/menuitem?id=${id}`,
           );
-          setItemName(response.data.name || `Menu Item #${id}`);
+          setItemName(true);
         } catch (error) {
           console.error("Error fetching item:", error);
killedBy: CreateReviewPage branch coverage fetches item name and passes it to ReviewForm when idParam present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Fetched Item Name"
Received: ""

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] LogicalOperator
main/pages/ReviewsPage/CreateReviewsPage.js:29:23
           const response = await axios.get(
             `/api/diningcommons/menuitem?id=${id}`,
           );
-          setItemName(response.data.name || `Menu Item #${id}`);
+          setItemName(response.data.name && `Menu Item #${id}`);
         } catch (error) {
           console.error("Error fetching item:", error);
killedBy: CreateReviewPage branch coverage fetches item name and passes it to ReviewForm when idParam present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Fetched Item Name"
Received: "Menu Item #7"

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/ReviewsPage/CreateReviewsPage.js:30:25
             `/api/diningcommons/menuitem?id=${id}`,
           );
           setItemName(response.data.name || `Menu Item #${id}`);
-        } catch (error) {
-          console.error("Error fetching item:", error);
-          setItemName(`Menu Item #${id}`);
-        } finally {
+        } catch (error) {} finally {
           setIsLoadingItem(false);
         }
killedBy: CreateReviewPage branch coverage falls back to Menu Item #id when item fetch fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Menu Item #7"
Received: "no-item-name"

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/ReviewsPage/CreateReviewsPage.js:32:23
           setItemName(response.data.name || `Menu Item #${id}`);
         } catch (error) {
           console.error("Error fetching item:", error);
-          setItemName(`Menu Item #${id}`);
+          setItemName(``);
         } finally {
           setIsLoadingItem(false);
killedBy: CreateReviewPage branch coverage falls back to Menu Item #id when item fetch fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Menu Item #7"
Received: "no-item-name"

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/ReviewsPage/CreateReviewsPage.js:33:19
         } catch (error) {
           console.error("Error fetching item:", error);
           setItemName(`Menu Item #${id}`);
-        } finally {
-          setIsLoadingItem(false);
-        }
+        } finally {}
       };
 
killedBy: CreateReviewPage branch coverage fetches item name and passes it to ReviewForm when idParam present
statusReason: Error: Unable to find an element by: [data-testid="item-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="pt-2"

[Killed] BooleanLiteral
main/pages/ReviewsPage/CreateReviewsPage.js:34:28
           console.error("Error fetching item:", error);
           setItemName(`Menu Item #${id}`);
         } finally {
-          setIsLoadingItem(false);
+          setIsLoadingItem(true);
         }
       };
killedBy: CreateReviewPage branch coverage fetches item name and passes it to ReviewForm when idParam present
statusReason: Error: Unable to find an element by: [data-testid="item-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="pt-2"

[Killed] ArrayDeclaration
main/pages/ReviewsPage/CreateReviewsPage.js:40:6
 
       fetchItemName();
     }
-  }, [id]);
+  }, []);
 
   const submitAction = async (formData) => {
killedBy: CreateReviewPage mutation killing tests refetches item when id param changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/diningcommons/menuitem?id=2"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ConditionalExpression
main/pages/ReviewsPage/CreateReviewsPage.js:72:27
       });
 
       const review = response.data;
-      const displayName = review.item?.name || itemName;
+      const displayName = true;
       const rating = review.itemsStars;
       const comment =
killedBy: CreateReviewPage branch coverage submits successfully using fetched item name and includes dateServed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "✅ Review submitted for \"Named Dish\"
⭐ Rating: 3
💬 Comment: Great!",

[Killed] OptionalChaining
main/pages/ReviewsPage/CreateReviewsPage.js:72:27
       });
 
       const review = response.data;
-      const displayName = review.item?.name || itemName;
+      const displayName = review.item.name || itemName;
       const rating = review.itemsStars;
       const comment =
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "✅ Review submitted for \"Menu Item #77\"
⭐ Rating: 2
💬 Comment: Decent", {"autoClose": 8000}

Number of calls: 0

[Killed] OptionalChaining
main/pages/ReviewsPage/CreateReviewsPage.js:75:9
       const displayName = review.item?.name || itemName;
       const rating = review.itemsStars;
       const comment =
-        review.reviewerComments?.trim() || "No comments provided.";
+        review.reviewerComments.trim() || "No comments provided.";
 
       toast.success(
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "✅ Review submitted for \"Test Dish\"
⭐ Rating: 4
💬 Comment: No comments provided.", {"autoClose": 8000}

Number of calls: 0

[Killed] StringLiteral
main/pages/ReviewsPage/CreateReviewsPage.js:78:9
         review.reviewerComments?.trim() || "No comments provided.";
 
       toast.success(
-        `✅ Review submitted for "${displayName}"\n⭐ Rating: ${rating}\n💬 Comment: ${comment}`,
+        ``
         { autoClose: 8000 },
       );
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "✅ Review submitted for \"Named Dish\"
⭐ Rating: 3
💬 Comment: Great!",

[Killed] ObjectLiteral
main/pages/ReviewsPage/CreateReviewsPage.js:79:9
 
       toast.success(
         `✅ Review submitted for "${displayName}"\n⭐ Rating: ${rating}\n💬 Comment: ${comment}`,
-        { autoClose: 8000 },
+        {},
       );
 
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "✅ Review submitted for \"Named Dish\"
⭐ Rating: 3
💬 Comment: Great!",

[Killed] ConditionalExpression
main/pages/ReviewsPage/CreateReviewsPage.js:87:23
       }, 1000);
     } catch (e) {
       console.error(e);
-      const message = e.response?.data?.message || e.response?.data?.error;
+      const message = true;
       if (e.response?.status === 404 && message.includes("MenuItem")) {
         toast.error(`Menu item with ID ${itemId} not found.`);
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Menu item with ID 88 not found."

Number of calls: 0

[Killed] BlockStatement
main/pages/ReviewsPage/CreateReviewsPage.js:88:71
     } catch (e) {
       console.error(e);
       const message = e.response?.data?.message || e.response?.data?.error;
-      if (e.response?.status === 404 && message.includes("MenuItem")) {
-        toast.error(`Menu item with ID ${itemId} not found.`);
-      } else {
+      if (e.response?.status === 404 && message.includes("MenuItem")) {} else {
         toast.error("Error creating review.");
       }
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Menu item with ID 88 not found."

Number of calls: 0

[Killed] ConditionalExpression
main/pages/ReviewsPage/CreateReviewsPage.js:102:7
     dateServed: "", // Initialize the date field
   };
 
-  if (isLoadingItem) {
+  if (true) {
     return (
       <BasicLayout>
killedBy: CreateReviewPage branch coverage passes initialContents with dateServed field when no idParam
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="initial-contents"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="pt-2"

[Killed] BlockStatement
main/pages/ReviewsPage/CreateReviewsPage.js:102:22
     dateServed: "", // Initialize the date field
   };
 
-  if (isLoadingItem) {
-    return (
-      <BasicLayout>
-        <div className="pt-2">
-          <h1>Leave a Review</h1>
-          <p>Loading item information...</p>
-        </div>
-      </BasicLayout>
-    );
-  }
+  if (isLoadingItem) {}
 
   return (
killedBy: CreateReviewPage branch coverage fetches item name and passes it to ReviewForm when idParam present
statusReason: TestingLibraryElementError: Unable to find an element with the text: Loading item information.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="pt-2"
