[Killed] BlockStatement
main/pages/ReviewsPage/ReviewEditPage.js:4:42
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 import { useParams } from "react-router-dom";
 
-export default function ReviewEditPage() {
-  // Stryker disable all : placeholder for future implementation
-  const { id } = useParams();
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Edit review with id {id}</h1>
-        <p>Coming soon!</p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function ReviewEditPage() {}
 
killedBy: ReviewEditPage tests Renders expected content with correct ID
statusReason: Error: Unable to find an element with the text: Edit review with id 42. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
