[Killed] ArrayDeclaration
src/main/components/AliasApprovalTable.js:16:5
     error,
     status,
   } = useBackend(
-    ["/api/admin/usersWithProposedAlias"],
+    [],
     { method: "GET", url: "/api/admin/usersWithProposedAlias" },
     [],
killedBy: AliasApprovalTable tests useBackend is called with correct parameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Array [
-   "/api/admin/usersWithProposedAlias",
- ]

[Killed] StringLiteral
src/main/components/AliasApprovalTable.js:17:27
     status,
   } = useBackend(
     ["/api/admin/usersWithProposedAlias"],
-    { method: "GET", url: "/api/admin/usersWithProposedAlias" },
+    { method: "GET", url: "" },
     [],
   );
killedBy: AliasApprovalTable tests useBackend is called with correct parameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  ["/api/admin/usersWithProposedAlias"],
  Object {
    "method": "GET",

[Killed] BlockStatement
src/main/components/AliasApprovalTable.js:21:46
     [],
   );
 
-  const objectToAxiosParams = (variables) => {
-    if (
-      !variables ||
-      typeof variables.id === "undefined" ||
-      typeof variables.approved === "undefined"
-    ) {
-      console.error("Missing id or approved in mutation variables:", variables);
-      return {};
-    }
-    return {
-      url: "/api/currentUser/updateAliasModeration",
-      method: "PUT",
-      params: {
-        id: variables.id,
-        approved: variables.approved,
-      },
-    };
-  };
+  const objectToAxiosParams = (variables) => {};
 
   const onSuccess = (returnedUser, variables) => {
killedBy: AliasApprovalTable tests objectToAxiosParams function returns correct parameters
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "PUT", "params": {"approved": true, "id": 1}, "url": "/api/currentUser/updateAliasModeration"}
Received: undefined

[Killed] ConditionalExpression
src/main/components/AliasApprovalTable.js:23:7
 
   const objectToAxiosParams = (variables) => {
     if (
-      !variables ||
-      typeof variables.id === "undefined" ||
-      typeof variables.approved === "undefined"
+      false
     ) {
       console.error("Missing id or approved in mutation variables:", variables);
killedBy: AliasApprovalTable tests objectToAxiosParams handles invalid parameters
statusReason: TypeError: Cannot read properties of null (reading 'id')

[Killed] ConditionalExpression
src/main/components/AliasApprovalTable.js:23:7
 
   const objectToAxiosParams = (variables) => {
     if (
-      !variables ||
-      typeof variables.id === "undefined" ||
+      false ||
       typeof variables.approved === "undefined"
     ) {
killedBy: AliasApprovalTable tests objectToAxiosParams handles invalid parameters
statusReason: TypeError: Cannot read properties of null (reading 'approved')

[Killed] ConditionalExpression
src/main/components/AliasApprovalTable.js:24:7
   const objectToAxiosParams = (variables) => {
     if (
       !variables ||
-      typeof variables.id === "undefined" ||
+      false ||
       typeof variables.approved === "undefined"
     ) {
killedBy: AliasApprovalTable tests objectToAxiosParams handles invalid parameters
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 8

- Object {}
+ Object {
+   "method": "PUT",

[Killed] EqualityOperator
src/main/components/AliasApprovalTable.js:24:7
   const objectToAxiosParams = (variables) => {
     if (
       !variables ||
-      typeof variables.id === "undefined" ||
+      typeof variables.id !== "undefined" ||
       typeof variables.approved === "undefined"
     ) {
killedBy: AliasApprovalTable tests objectToAxiosParams function returns correct parameters
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Object {
-   "method": "PUT",
-   "params": Object {

[Killed] EqualityOperator
src/main/components/AliasApprovalTable.js:25:7
     if (
       !variables ||
       typeof variables.id === "undefined" ||
-      typeof variables.approved === "undefined"
+      typeof variables.approved !== "undefined"
     ) {
       console.error("Missing id or approved in mutation variables:", variables);
killedBy: AliasApprovalTable tests objectToAxiosParams function returns correct parameters
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Object {
-   "method": "PUT",
-   "params": Object {

[Killed] ConditionalExpression
src/main/components/AliasApprovalTable.js:25:7
     if (
       !variables ||
       typeof variables.id === "undefined" ||
-      typeof variables.approved === "undefined"
+      false
     ) {
       console.error("Missing id or approved in mutation variables:", variables);
killedBy: AliasApprovalTable tests objectToAxiosParams handles invalid parameters
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 8

- Object {}
+ Object {
+   "method": "PUT",

[Killed] BlockStatement
src/main/components/AliasApprovalTable.js:26:7
       !variables ||
       typeof variables.id === "undefined" ||
       typeof variables.approved === "undefined"
-    ) {
-      console.error("Missing id or approved in mutation variables:", variables);
-      return {};
-    }
+    ) {}
     return {
       url: "/api/currentUser/updateAliasModeration",
killedBy: AliasApprovalTable tests objectToAxiosParams handles invalid parameters
statusReason: TypeError: Cannot read properties of null (reading 'id')

[Killed] StringLiteral
src/main/components/AliasApprovalTable.js:27:21
       typeof variables.id === "undefined" ||
       typeof variables.approved === "undefined"
     ) {
-      console.error("Missing id or approved in mutation variables:", variables);
+      console.error("", variables);
       return {};
     }
killedBy: AliasApprovalTable tests objectToAxiosParams handles invalid parameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Missing id or approved in mutation variables:", null
Received
       1: "", null
       2: "", {"id": 1}
       3: "", {"approved": true}

[Killed] StringLiteral
src/main/components/AliasApprovalTable.js:31:12
       return {};
     }
     return {
-      url: "/api/currentUser/updateAliasModeration",
+      url: "",
       method: "PUT",
       params: {
killedBy: AliasApprovalTable tests objectToAxiosParams function returns correct parameters
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,7 +2,7 @@
    "method": "PUT",
    "params": Object {

[Killed] BlockStatement
src/main/components/AliasApprovalTable.js:40:50
     };
   };
 
-  const onSuccess = (returnedUser, variables) => {
-    toast(
-      `${variables.approved ? "Approved" : "Rejected"} alias: ${returnedUser.alias}`,
-    );
-    queryClient.invalidateQueries("/api/admin/usersWithProposedAlias");
-  };
+  const onSuccess = (returnedUser, variables) => {};
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess });
killedBy: AliasApprovalTable tests mutation onSuccess handler calls toast and invalidates queries
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Approved alias: TestAlias"

Number of calls: 0

[Killed] StringLiteral
src/main/components/AliasApprovalTable.js:42:44
 
   const onSuccess = (returnedUser, variables) => {
     toast(
-      `${variables.approved ? "Approved" : "Rejected"} alias: ${returnedUser.alias}`,
+      `${variables.approved ? "Approved" : ""} alias: ${returnedUser.alias}`,
     );
     queryClient.invalidateQueries("/api/admin/usersWithProposedAlias");
killedBy: AliasApprovalTable tests onSuccess handler generates correct rejected message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Rejected alias: TestAlias"
Received: " alias: TestAlias"

Number of calls: 1

[Killed] ObjectLiteral
src/main/components/AliasApprovalTable.js:47:60
     queryClient.invalidateQueries("/api/admin/usersWithProposedAlias");
   };
 
-  const mutation = useBackendMutation(objectToAxiosParams, { onSuccess });
+  const mutation = useBackendMutation(objectToAxiosParams, {});
 
   const columns = [
killedBy: AliasApprovalTable tests useBackendMutation is called with objectToAxiosParams function
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  [Function objectToAxiosParams],
- Object {
-   "onSuccess": Any<Function>,

[Killed] ArrayDeclaration
src/main/components/AliasApprovalTable.js:49:19
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess });
 
-  const columns = [
-    { Header: "Alias", accessor: "alias" },
-    { Header: "Proposed Alias", accessor: "proposedAlias" },
-    ButtonColumn("Approve", "success", (cell) => {
-      const user = cell.row.original;
-      mutation.mutate({ id: user.id, approved: true });
-    }),
-    ButtonColumn("Reject", "danger", (cell) => {
-      const user = cell.row.original;
-      mutation.mutate({ id: user.id, approved: false });
-    }),
-  ];
+  const columns = [];
 
   if (status === "loading") return <div>Loading...</div>;
killedBy: AliasApprovalTable tests renders table with aliases
statusReason: TestingLibraryElementError: Unable to find an element with the text: OldAlias. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="Toastify"
    />

[Killed] StringLiteral
src/main/components/AliasApprovalTable.js:50:34
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess });
 
   const columns = [
-    { Header: "Alias", accessor: "alias" },
+    { Header: "Alias", accessor: "" },
     { Header: "Proposed Alias", accessor: "proposedAlias" },
     ButtonColumn("Approve", "success", (cell) => {
killedBy: AliasApprovalTable tests renders table with aliases
statusReason: TestingLibraryElementError: Unable to find an element with the text: OldAlias. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="Toastify"
    />

[Killed] ObjectLiteral
src/main/components/AliasApprovalTable.js:50:5
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess });
 
   const columns = [
-    { Header: "Alias", accessor: "alias" },
+    {},
     { Header: "Proposed Alias", accessor: "proposedAlias" },
     ButtonColumn("Approve", "success", (cell) => {
killedBy: AliasApprovalTable tests renders table with aliases
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
src/main/components/AliasApprovalTable.js:51:5
 
   const columns = [
     { Header: "Alias", accessor: "alias" },
-    { Header: "Proposed Alias", accessor: "proposedAlias" },
+    {},
     ButtonColumn("Approve", "success", (cell) => {
       const user = cell.row.original;
killedBy: AliasApprovalTable tests renders table with aliases
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
src/main/components/AliasApprovalTable.js:52:50
   const columns = [
     { Header: "Alias", accessor: "alias" },
     { Header: "Proposed Alias", accessor: "proposedAlias" },
-    ButtonColumn("Approve", "success", (cell) => {
-      const user = cell.row.original;
-      mutation.mutate({ id: user.id, approved: true });
-    }),
+    ButtonColumn("Approve", "success", (cell) => {}),
     ButtonColumn("Reject", "danger", (cell) => {
       const user = cell.row.original;
killedBy: AliasApprovalTable tests approve button triggers mutation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"approved": true, "id": 1}

Number of calls: 0

[Killed] BooleanLiteral
src/main/components/AliasApprovalTable.js:54:48
     { Header: "Proposed Alias", accessor: "proposedAlias" },
     ButtonColumn("Approve", "success", (cell) => {
       const user = cell.row.original;
-      mutation.mutate({ id: user.id, approved: true });
+      mutation.mutate({ id: user.id, approved: false });
     }),
     ButtonColumn("Reject", "danger", (cell) => {
killedBy: AliasApprovalTable tests approve button triggers mutation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "approved": true,
+   "approved": false,

[Killed] ObjectLiteral
src/main/components/AliasApprovalTable.js:54:23
     { Header: "Proposed Alias", accessor: "proposedAlias" },
     ButtonColumn("Approve", "success", (cell) => {
       const user = cell.row.original;
-      mutation.mutate({ id: user.id, approved: true });
+      mutation.mutate({});
     }),
     ButtonColumn("Reject", "danger", (cell) => {
killedBy: AliasApprovalTable tests approve button triggers mutation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "approved": true,
-   "id": 1,

[Killed] BlockStatement
src/main/components/AliasApprovalTable.js:56:48
       const user = cell.row.original;
       mutation.mutate({ id: user.id, approved: true });
     }),
-    ButtonColumn("Reject", "danger", (cell) => {
-      const user = cell.row.original;
-      mutation.mutate({ id: user.id, approved: false });
-    }),
+    ButtonColumn("Reject", "danger", (cell) => {}),
   ];
 
killedBy: AliasApprovalTable tests reject button triggers mutation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"approved": false, "id": 2}

Number of calls: 0

[Killed] BooleanLiteral
src/main/components/AliasApprovalTable.js:58:48
     }),
     ButtonColumn("Reject", "danger", (cell) => {
       const user = cell.row.original;
-      mutation.mutate({ id: user.id, approved: false });
+      mutation.mutate({ id: user.id, approved: true });
     }),
   ];
killedBy: AliasApprovalTable tests reject button triggers mutation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "approved": false,
+   "approved": true,

[Killed] ConditionalExpression
src/main/components/AliasApprovalTable.js:62:7
     }),
   ];
 
-  if (status === "loading") return <div>Loading...</div>;
+  if (false) return <div>Loading...</div>;
   if (error) return <div>Error loading aliases</div>;
 
killedBy: AliasApprovalTable tests shows loading state
statusReason: TypeError: Cannot read properties of null (reading 'forEach')

[Killed] EqualityOperator
src/main/components/AliasApprovalTable.js:62:7
     }),
   ];
 
-  if (status === "loading") return <div>Loading...</div>;
+  if (status !== "loading") return <div>Loading...</div>;
   if (error) return <div>Error loading aliases</div>;
 
killedBy: AliasApprovalTable tests renders table with aliases
statusReason: TestingLibraryElementError: Unable to find an element with the text: OldAlias. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="Toastify"
    />

[Killed] ConditionalExpression
src/main/components/AliasApprovalTable.js:63:7
   ];
 
   if (status === "loading") return <div>Loading...</div>;
-  if (error) return <div>Error loading aliases</div>;
+  if (true) return <div>Error loading aliases</div>;
 
   return <OurTable data={users} columns={columns} testid={testid} />;
killedBy: AliasApprovalTable tests renders table with aliases
statusReason: TestingLibraryElementError: Unable to find an element with the text: OldAlias. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="Toastify"
    />

[Killed] ConditionalExpression
src/main/components/AliasApprovalTable.js:63:7
   ];
 
   if (status === "loading") return <div>Loading...</div>;
-  if (error) return <div>Error loading aliases</div>;
+  if (false) return <div>Error loading aliases</div>;
 
   return <OurTable data={users} columns={columns} testid={testid} />;
killedBy: AliasApprovalTable tests shows error state
statusReason: TypeError: Cannot read properties of null (reading 'forEach')
