[Killed] BlockStatement
src/main/pages/AliasApprovalPage.js:6:45
 import AliasApprovalTable from "main/components/AliasApprovalTable";
 import { useBackend } from "main/utils/useBackend";
 
-export default function AliasApprovalPage() {
-  const { data: users } = useBackend(
-    ["/api/admin/usersWithProposedAlias"],
-    { method: "GET", url: "/api/admin/usersWithProposedAlias" },
-    [],
-  );
-
-  return (
-    <BasicLayout>
-      <h1>Alias Approval</h1>
-      <AliasApprovalTable users={users} />
-    </BasicLayout>
-  );
-}
+export default function AliasApprovalPage() {}
 
killedBy: AliasApprovalPage tests renders page title
statusReason: TestingLibraryElementError: Unable to find an element with the text: Alias Approval. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
src/main/pages/AliasApprovalPage.js:9:15
 export default function AliasApprovalPage() {
   const { data: users } = useBackend(
     ["/api/admin/usersWithProposedAlias"],
-    { method: "GET", url: "/api/admin/usersWithProposedAlias" },
+    { method: "", url: "/api/admin/usersWithProposedAlias" },
     [],
   );
killedBy: AliasApprovalPage tests useBackend hook parameters are correct
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "GET"
Received: ""
